In [31]:
# import Library yang dibutuhkan
import pandas as pd                   #dataframe manipulation
import numpy as np                    #scientific camputing
import seaborn as sns                 #visualization
import matplotlib.pyplot as plt       #visualization
%matplotlib inline
sns.set(color_codes=True)

import warnings
warnings.filterwarnings('ignore')


# Tables yang akan digunakan
'''
name.basics.tsv.gz
title.basics.tsv.gz
title.crew.tsv.gz
title.episode.tsv.gz
title.ratings.tsv.gz
'''

# Load all the TSV file into a DataFrame
#df = pd.read_csv("C:/Users/HP/Desktop/Data IMDb/name.basics.tsv", sep='\t')
#title_basics = pd.read_csv("C:/Users/HP/Desktop/Data IMDb/title.basics.tsv", sep='\t')
df = pd.read_csv("C:/Users/HP/Desktop/Data IMDb/title.crew.tsv", sep='\t', na_values="\\N") 
'''diperbarui karena formatting NaN'''
#title_episode = pd.read_csv("C:/Users/HP/Desktop/Data IMDb/title.episode.tsv", sep='\t')
#title_ratings = pd.read_csv("C:/Users/HP/Desktop/Data IMDb/title.ratings.tsv", sep='\t')

# Display the first 5 rows
df.head()
#title_basics.head()
#title_crew.head()
#title_episode.head()
#title_ratings.head()

      tconst  directors writers
0  tt0000001  nm0005690     NaN
1  tt0000002  nm0721526     NaN
2  tt0000003  nm0721526     NaN
3  tt0000004  nm0721526     NaN
4  tt0000005  nm0005690     NaN

In [5]:
'''Data Wrangling'''

# Cek tipe data
df.dtypes

tconst       object
directors    object
writers      object
dtype: object

In [7]:
# Cek duplicates
df.shape

(10610707, 3)

In [25]:
# Menunjukkan Duplicates
df[df.duplicated()]

Empty DataFrame
Columns: [tconst, directors, writers]
Index: []

In [27]:
'''Tidak ada duplicates'''

# Cek Missing Values
print(df.isnull().sum())

tconst             0
directors    4052362
writers      4713106
dtype: int64

In [19]:
'''Tidak ada missing value, tapi diketahui ada blackslash N, jadi kita cek keterangan itu'''

#print(df["directors"].unique())
#unique value di directors
''' backslash N sbg NaN tidak terbaca python, maka akan kita ganti'''

#df = pd.read_csv("data.csv", na_values="\\N")  # Perhatikan double backslash untuk escape karakter
#df = pd.read_csv("C:/Users/HP/Desktop/Data IMDb/title.crew.tsv", sep='\t', na_values="\\N")
#df.head()

      tconst  directors writers
0  tt0000001  nm0005690     NaN
1  tt0000002  nm0721526     NaN
2  tt0000003  nm0721526     NaN
3  tt0000004  nm0721526     NaN
4  tt0000005  nm0005690     NaN

In [29]:
# Menghapus Missing Value
df = df.dropna()
df.count()

tconst       5052987
directors    5052987
writers      5052987
dtype: int64

In [ ]:
sebenrnya ga diapus juga gapapa si.... #hold

In [ ]:
# Hapus kolom yang tidak digunakan
df = df.drop(['birthYear', 'deathYear', 'primaryProfession', 'knownForTitles'], axis=1)

In [35]:
# Rename kolom
df = df.rename(columns = {"tconst" : "movieID"})
df.head()

     movieID  directors writers
0  tt0000001  nm0005690     NaN
1  tt0000002  nm0721526     NaN
2  tt0000003  nm0721526     NaN
3  tt0000004  nm0721526     NaN
4  tt0000005  nm0005690     NaN

In [37]:
'''Export Dataframe'''

# Export into CSV
df.to_csv("C:/Users/HP/Desktop/Data IMDb/title.crew.csv", index=False)